; domain
(define (domain satellite)
  (:requirements :typing :fluents :equality)
 (:types satellite direction instrument mode)
 (:predicates 
               (on_board ?i - instrument ?s - satellite)
	       (supports ?i - instrument ?m - mode)
	       (pointing ?s - satellite ?d - direction)
	       (power_avail ?s - satellite)
	       (power_on ?i - instrument)
	       (calibrated ?i - instrument)
	       (have_image ?d - direction ?m - mode)
	       (calibration_target ?i - instrument ?d - direction))
 
 

  (:functions (data_capacity ?s - satellite)
	      (data ?d - direction ?m - mode)
		(slew_time ?a ?b - direction)
		(data-stored)
		(fuel ?s - satellite)
		(fuel-used)
  )

  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev)
                   (not (= ?d_new ?d_prev))
		(>= (fuel ?s) (slew_time ?d_new ?d_prev))
              )
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))
		(decrease (fuel ?s) (slew_time ?d_new ?d_prev))
		(increase (fuel-used) (slew_time ?d_new ?d_prev))
           )
  )

 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
 
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s)
                 )
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))
           )
          
  )

 
  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
 
   :precondition (and (on_board ?i ?s)
                      (power_on ?i) 
                  )
   :effect (and (not (power_on ?i))
                (power_avail ?s)
           )
  )

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i)
                  )
   :effect (calibrated ?i)
  )
 

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d)
                      (power_on ?i)
			  (>= (data_capacity ?s) (data ?d ?m))
               )
   :effect (and (decrease (data_capacity ?s) (data ?d ?m)) (have_image ?d ?m)
		(increase (data-stored) (data ?d ?m)))
  )
)

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	thermograph3 - mode
	image0 - mode
	thermograph1 - mode
	thermograph2 - mode
	Star0 - direction
	GroundStation1 - direction
	Star3 - direction
	GroundStation4 - direction
	GroundStation2 - direction
	Planet5 - direction
	Star6 - direction
	Planet7 - direction
	Planet8 - direction
	Star9 - direction
	Planet10 - direction
	Planet11 - direction
)
(:init
	(supports instrument0 thermograph1)
	(supports instrument0 thermograph2)
	(supports instrument0 image0)
	(calibration_target instrument0 GroundStation4)
	(supports instrument1 thermograph2)
	(calibration_target instrument1 GroundStation2)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Planet8)
	(= (data_capacity satellite0) 1000)
	(= (fuel satellite0) 139)
	(= (data Planet5 thermograph3) 220)
	(= (data Star6 thermograph3) 196)
	(= (data Planet7 thermograph3) 218)
	(= (data Planet8 thermograph3) 171)
	(= (data Star9 thermograph3) 63)
	(= (data Planet10 thermograph3) 229)
	(= (data Planet11 thermograph3) 22)
	(= (data Planet5 image0) 107)
	(= (data Star6 image0) 294)
	(= (data Planet7 image0) 198)
	(= (data Planet8 image0) 201)
	(= (data Star9 image0) 105)
	(= (data Planet10 image0) 125)
	(= (data Planet11 image0) 190)
	(= (data Planet5 thermograph1) 115)
	(= (data Star6 thermograph1) 27)
	(= (data Planet7 thermograph1) 115)
	(= (data Planet8 thermograph1) 231)
	(= (data Star9 thermograph1) 55)
	(= (data Planet10 thermograph1) 182)
	(= (data Planet11 thermograph1) 256)
	(= (data Planet5 thermograph2) 175)
	(= (data Star6 thermograph2) 193)
	(= (data Planet7 thermograph2) 121)
	(= (data Planet8 thermograph2) 81)
	(= (data Star9 thermograph2) 177)
	(= (data Planet10 thermograph2) 133)
	(= (data Planet11 thermograph2) 215)
	(= (slew_time GroundStation1 Star0) 47.17)
	(= (slew_time Star0 GroundStation1) 47.17)
	(= (slew_time Star3 Star0) 14.72)
	(= (slew_time Star0 Star3) 14.72)
	(= (slew_time Star3 GroundStation1) 20.38)
	(= (slew_time GroundStation1 Star3) 20.38)
	(= (slew_time Star3 GroundStation2) 4.643)
	(= (slew_time GroundStation2 Star3) 4.643)
	(= (slew_time GroundStation4 Star0) 34.23)
	(= (slew_time Star0 GroundStation4) 34.23)
	(= (slew_time GroundStation4 GroundStation1) 23.49)
	(= (slew_time GroundStation1 GroundStation4) 23.49)
	(= (slew_time GroundStation4 GroundStation2) 2.638)
	(= (slew_time GroundStation2 GroundStation4) 2.638)
	(= (slew_time GroundStation4 Star3) 40.72)
	(= (slew_time Star3 GroundStation4) 40.72)
	(= (slew_time GroundStation2 Star0) 36.64)
	(= (slew_time Star0 GroundStation2) 36.64)
	(= (slew_time GroundStation2 GroundStation1) 24.61)
	(= (slew_time GroundStation1 GroundStation2) 24.61)
	(= (slew_time Planet5 Star0) 15.38)
	(= (slew_time Star0 Planet5) 15.38)
	(= (slew_time Planet5 GroundStation1) 15.17)
	(= (slew_time GroundStation1 Planet5) 15.17)
	(= (slew_time Planet5 GroundStation2) 3.775)
	(= (slew_time GroundStation2 Planet5) 3.775)
	(= (slew_time Planet5 Star3) 36.87)
	(= (slew_time Star3 Planet5) 36.87)
	(= (slew_time Planet5 GroundStation4) 28.46)
	(= (slew_time GroundStation4 Planet5) 28.46)
	(= (slew_time Star6 Star0) 1.172)
	(= (slew_time Star0 Star6) 1.172)
	(= (slew_time Star6 GroundStation1) 21.86)
	(= (slew_time GroundStation1 Star6) 21.86)
	(= (slew_time Star6 GroundStation2) 44.5)
	(= (slew_time GroundStation2 Star6) 44.5)
	(= (slew_time Star6 Star3) 2.22)
	(= (slew_time Star3 Star6) 2.22)
	(= (slew_time Star6 GroundStation4) 19.52)
	(= (slew_time GroundStation4 Star6) 19.52)
	(= (slew_time Star6 Planet5) 48.47)
	(= (slew_time Planet5 Star6) 48.47)
	(= (slew_time Planet7 Star0) 6.411)
	(= (slew_time Star0 Planet7) 6.411)
	(= (slew_time Planet7 GroundStation1) 3.973)
	(= (slew_time GroundStation1 Planet7) 3.973)
	(= (slew_time Planet7 GroundStation2) 12.38)
	(= (slew_time GroundStation2 Planet7) 12.38)
	(= (slew_time Planet7 Star3) 13.68)
	(= (slew_time Star3 Planet7) 13.68)
	(= (slew_time Planet7 GroundStation4) 29.44)
	(= (slew_time GroundStation4 Planet7) 29.44)
	(= (slew_time Planet7 Planet5) 38.27)
	(= (slew_time Planet5 Planet7) 38.27)
	(= (slew_time Planet7 Star6) 61.14)
	(= (slew_time Star6 Planet7) 61.14)
	(= (slew_time Planet8 Star0) 38.6)
	(= (slew_time Star0 Planet8) 38.6)
	(= (slew_time Planet8 GroundStation1) 54.12)
	(= (slew_time GroundStation1 Planet8) 54.12)
	(= (slew_time Planet8 GroundStation2) 69.29)
	(= (slew_time GroundStation2 Planet8) 69.29)
	(= (slew_time Planet8 Star3) 31.45)
	(= (slew_time Star3 Planet8) 31.45)
	(= (slew_time Planet8 GroundStation4) 61.02)
	(= (slew_time GroundStation4 Planet8) 61.02)
	(= (slew_time Planet8 Planet5) 3.879)
	(= (slew_time Planet5 Planet8) 3.879)
	(= (slew_time Planet8 Star6) 31.04)
	(= (slew_time Star6 Planet8) 31.04)
	(= (slew_time Planet8 Planet7) 52.3)
	(= (slew_time Planet7 Planet8) 52.3)
	(= (slew_time Star9 Star0) 33.45)
	(= (slew_time Star0 Star9) 33.45)
	(= (slew_time Star9 GroundStation1) 20.17)
	(= (slew_time GroundStation1 Star9) 20.17)
	(= (slew_time Star9 GroundStation2) 86.12)
	(= (slew_time GroundStation2 Star9) 86.12)
	(= (slew_time Star9 Star3) 27.03)
	(= (slew_time Star3 Star9) 27.03)
	(= (slew_time Star9 GroundStation4) 26.65)
	(= (slew_time GroundStation4 Star9) 26.65)
	(= (slew_time Star9 Planet5) 11.64)
	(= (slew_time Planet5 Star9) 11.64)
	(= (slew_time Star9 Star6) 46.13)
	(= (slew_time Star6 Star9) 46.13)
	(= (slew_time Star9 Planet7) 11.11)
	(= (slew_time Planet7 Star9) 11.11)
	(= (slew_time Star9 Planet8) 68.13)
	(= (slew_time Planet8 Star9) 68.13)
	(= (slew_time Planet10 Star0) 10.09)
	(= (slew_time Star0 Planet10) 10.09)
	(= (slew_time Planet10 GroundStation1) 55.21)
	(= (slew_time GroundStation1 Planet10) 55.21)
	(= (slew_time Planet10 GroundStation2) 63.93)
	(= (slew_time GroundStation2 Planet10) 63.93)
	(= (slew_time Planet10 Star3) 48.05)
	(= (slew_time Star3 Planet10) 48.05)
	(= (slew_time Planet10 GroundStation4) 84.25)
	(= (slew_time GroundStation4 Planet10) 84.25)
	(= (slew_time Planet10 Planet5) 8.888)
	(= (slew_time Planet5 Planet10) 8.888)
	(= (slew_time Planet10 Star6) 58.89)
	(= (slew_time Star6 Planet10) 58.89)
	(= (slew_time Planet10 Planet7) 7.573)
	(= (slew_time Planet7 Planet10) 7.573)
	(= (slew_time Planet10 Planet8) 7.09)
	(= (slew_time Planet8 Planet10) 7.09)
	(= (slew_time Planet10 Star9) 86.39)
	(= (slew_time Star9 Planet10) 86.39)
	(= (slew_time Planet11 Star0) 75.98)
	(= (slew_time Star0 Planet11) 75.98)
	(= (slew_time Planet11 GroundStation1) 2.728)
	(= (slew_time GroundStation1 Planet11) 2.728)
	(= (slew_time Planet11 GroundStation2) 66.28)
	(= (slew_time GroundStation2 Planet11) 66.28)
	(= (slew_time Planet11 Star3) 26.02)
	(= (slew_time Star3 Planet11) 26.02)
	(= (slew_time Planet11 GroundStation4) 20.3)
	(= (slew_time GroundStation4 Planet11) 20.3)
	(= (slew_time Planet11 Planet5) 41.42)
	(= (slew_time Planet5 Planet11) 41.42)
	(= (slew_time Planet11 Star6) 8.241)
	(= (slew_time Star6 Planet11) 8.241)
	(= (slew_time Planet11 Planet7) 15.82)
	(= (slew_time Planet7 Planet11) 15.82)
	(= (slew_time Planet11 Planet8) 3.015)
	(= (slew_time Planet8 Planet11) 3.015)
	(= (slew_time Planet11 Star9) 37.65)
	(= (slew_time Star9 Planet11) 37.65)
	(= (slew_time Planet11 Planet10) 53.19)
	(= (slew_time Planet10 Planet11) 53.19)
	(= (data-stored) 0)
	(= (fuel-used) 0)
)
(:goal (and
	(have_image Planet5 image0)
	(have_image Star6 thermograph2)
	(have_image Planet7 thermograph1)
	(have_image Planet8 thermograph1)
	(have_image Star9 thermograph2)
))
(:metric minimize (fuel-used))

)

; plan
1. (turn_to satellite0 planet11 planet8)
   deleted: (pointing satellite0 planet8)
   added: (pointing satellite0 planet11)
   changed: (fuel satellite0) from 139 to 135.985, (fuel-used) from 0 to 3.015
   goals met: 0 of 5
2. (turn_to satellite0 groundstation1 planet11)
   deleted: (pointing satellite0 planet11)
   added: (pointing satellite0 groundstation1)
   changed: (fuel satellite0) from 135.985 to 133.257, (fuel-used) from 3.015 to 5.743
   goals met: 0 of 5
3. (turn_to satellite0 planet5 groundstation1)
   deleted: (pointing satellite0 groundstation1)
   added: (pointing satellite0 planet5)
   changed: (fuel satellite0) from 133.257 to 118.087, (fuel-used) from 5.743 to 20.913
   goals met: 0 of 5
4. (turn_to satellite0 planet8 planet5)
   deleted: (pointing satellite0 planet5)
   added: (pointing satellite0 planet8)
   changed: (fuel satellite0) from 118.087 to 114.208, (fuel-used) from 20.913 to 24.792
   goals met: 0 of 5
5. (turn_to satellite0 planet5 planet8)
   deleted: (pointing satellite0 planet8)
   added: (pointing satellite0 planet5)
   changed: (fuel satellite0) from 114.208 to 110.329, (fuel-used) from 24.792 to 28.671
   goals met: 0 of 5
6. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 0 of 5
7. (turn_to satellite0 planet8 planet5)
   deleted: (pointing satellite0 planet5)
   added: (pointing satellite0 planet8)
   changed: (fuel satellite0) from 110.329 to 106.45, (fuel-used) from 28.671 to 32.55
   goals met: 0 of 5
8. (turn_to satellite0 planet11 planet8)
   deleted: (pointing satellite0 planet8)
   added: (pointing satellite0 planet11)
   changed: (fuel satellite0) from 106.45 to 103.435, (fuel-used) from 32.55 to 35.565
   goals met: 0 of 5
9. (switch_off instrument1 satellite0)
   deleted: (power_on instrument1)
   added: (power_avail satellite0)
   goals met: 0 of 5
10. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 5
11. (turn_to satellite0 planet8 planet11)
   deleted: (pointing satellite0 planet11)
   added: (pointing satellite0 planet8)
   changed: (fuel satellite0) from 103.435 to 100.42, (fuel-used) from 35.565 to 38.58
   goals met: 0 of 5
12. (turn_to satellite0 planet5 planet8)
   deleted: (pointing satellite0 planet8)
   added: (pointing satellite0 planet5)
   changed: (fuel satellite0) from 100.42 to 96.541, (fuel-used) from 38.58 to 42.459
   goals met: 0 of 5
13. (turn_to satellite0 groundstation1 planet5)
   deleted: (pointing satellite0 planet5)
   added: (pointing satellite0 groundstation1)
   changed: (fuel satellite0) from 96.541 to 81.371, (fuel-used) from 42.459 to 57.629
   goals met: 0 of 5
14. (turn_to satellite0 planet11 groundstation1)
   deleted: (pointing satellite0 groundstation1)
   added: (pointing satellite0 planet11)
   changed: (fuel satellite0) from 81.371 to 78.643, (fuel-used) from 57.629 to 60.357
   goals met: 0 of 5
15. (turn_to satellite0 groundstation4 planet11)
   deleted: (pointing satellite0 planet11)
   added: (pointing satellite0 groundstation4)
   changed: (fuel satellite0) from 78.643 to 58.343, (fuel-used) from 60.357 to 80.657
   goals met: 0 of 5
16. (calibrate satellite0 instrument0 groundstation4)
   added: (calibrated instrument0)
   goals met: 0 of 5
17. (turn_to satellite0 groundstation2 groundstation4)
   deleted: (pointing satellite0 groundstation4)
   added: (pointing satellite0 groundstation2)
   changed: (fuel satellite0) from 58.343 to 55.705, (fuel-used) from 80.657 to 83.295
   goals met: 0 of 5
18. (turn_to satellite0 planet7 groundstation2)
   deleted: (pointing satellite0 groundstation2)
   added: (pointing satellite0 planet7)
   changed: (fuel satellite0) from 55.705 to 43.325, (fuel-used) from 83.295 to 95.675
   goals met: 0 of 5
19. (take_image satellite0 planet7 instrument0 thermograph1)
   added: (have_image planet7 thermograph1)
   changed: (data_capacity satellite0) from 1000 to 885, (data-stored) from 0 to 115
   goals met: 1 of 5
20. (turn_to satellite0 groundstation1 planet7)
   deleted: (pointing satellite0 planet7)
   added: (pointing satellite0 groundstation1)
   changed: (fuel satellite0) from 43.325 to 39.352, (fuel-used) from 95.675 to 99.648
   goals met: 1 of 5
21. (turn_to satellite0 planet11 groundstation1)
   deleted: (pointing satellite0 groundstation1)
   added: (pointing satellite0 planet11)
   changed: (fuel satellite0) from 39.352 to 36.624, (fuel-used) from 99.648 to 102.376
   goals met: 1 of 5
22. (turn_to satellite0 planet8 planet11)
   deleted: (pointing satellite0 planet11)
   added: (pointing satellite0 planet8)
   changed: (fuel satellite0) from 36.624 to 33.609, (fuel-used) from 102.376 to 105.391
   goals met: 1 of 5
23. (take_image satellite0 planet8 instrument0 thermograph1)
   added: (have_image planet8 thermograph1)
   changed: (data_capacity satellite0) from 885 to 654, (data-stored) from 115 to 346
   goals met: 2 of 5
24. (turn_to satellite0 planet5 planet8)
   deleted: (pointing satellite0 planet8)
   added: (pointing satellite0 planet5)
   changed: (fuel satellite0) from 33.609 to 29.73, (fuel-used) from 105.391 to 109.27
   goals met: 2 of 5
25. (take_image satellite0 planet5 instrument0 image0)
   added: (have_image planet5 image0)
   changed: (data_capacity satellite0) from 654 to 547, (data-stored) from 346 to 453
   goals met: 3 of 5
26. (turn_to satellite0 groundstation2 planet5)
   deleted: (pointing satellite0 planet5)
   added: (pointing satellite0 groundstation2)
   changed: (fuel satellite0) from 29.73 to 25.955, (fuel-used) from 109.27 to 113.045
   goals met: 3 of 5
27. (switch_off instrument0 satellite0)
   deleted: (power_on instrument0)
   added: (power_avail satellite0)
   goals met: 3 of 5
28. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 3 of 5
29. (calibrate satellite0 instrument1 groundstation2)
   added: (calibrated instrument1)
   goals met: 3 of 5
30. (turn_to satellite0 star3 groundstation2)
   deleted: (pointing satellite0 groundstation2)
   added: (pointing satellite0 star3)
   changed: (fuel satellite0) from 25.955 to 21.312, (fuel-used) from 113.045 to 117.688
   goals met: 3 of 5
31. (turn_to satellite0 star6 star3)
   deleted: (pointing satellite0 star3)
   added: (pointing satellite0 star6)
   changed: (fuel satellite0) from 21.312 to 19.092, (fuel-used) from 117.688 to 119.908
   goals met: 3 of 5
32. (take_image satellite0 star6 instrument1 thermograph2)
   added: (have_image star6 thermograph2)
   changed: (data_capacity satellite0) from 547 to 354, (data-stored) from 453 to 646
   goals met: 4 of 5
33. (turn_to satellite0 star0 star6)
   deleted: (pointing satellite0 star6)
   added: (pointing satellite0 star0)
   changed: (fuel satellite0) from 19.092 to 17.92, (fuel-used) from 119.908 to 121.08
   goals met: 4 of 5
34. (turn_to satellite0 planet7 star0)
   deleted: (pointing satellite0 star0)
   added: (pointing satellite0 planet7)
   changed: (fuel satellite0) from 17.92 to 11.509, (fuel-used) from 121.08 to 127.491
   goals met: 4 of 5
35. (turn_to satellite0 star9 planet7)
   deleted: (pointing satellite0 planet7)
   added: (pointing satellite0 star9)
   changed: (fuel satellite0) from 11.509 to 0.399, (fuel-used) from 127.491 to 138.601
   goals met: 4 of 5
36. (take_image satellite0 star9 instrument1 thermograph2)
   added: (have_image star9 thermograph2)
   changed: (data_capacity satellite0) from 354 to 177, (data-stored) from 646 to 823
   goals met: 5 of 5
